sdaiGetAttrsBN(Sdai_instS*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,SdaiPrimitiveType,System.Void*,BTEllipsis)
\details
Retrieves attribute values from a specified application instance.
\param instance       [in] An application instance.
\param numberAttr     [in] A number of required attributes.
\param attributeName  [in] A string that contains the name of the required attribute.
\param valueType      [in] An attribute value type.
\param value          [out] A placeholder for attribute values.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiVT_NVLD - Value type invalid.
* sdaiVA_NSET - Value not set.
* sdaiSY_ERR - Underlying system error.